{
  "content": "I went all in! 🔥\nI subscribed to ChatGPT-Pro for $200/month.\n\nLike someone way smarter than me once said:\n\"The risk of under-investing is dramatically greater than the risk of over-investing.\"\n— Sundar Pichai, CEO of Alphabet Inc.\n\nAnd I believe this is exactly the case with #AI.\n\nI've been experimenting with AI tools for over two years, but only now do I feel something fundamentally shifting.\n\nThe o1 model, released last autumn, is years ahead of GPT-4o.\nIt's so good that I kept hitting the usage limit with my Plus subscription.\n\nSo, I subscribed to Claude to try their latest 3.5 Sonnet model.\nSame issue, kept hitting the limit.\n\nTried DeepSeek... good quality, when it works.\nIt’s often unavailable and lacks the polished UX of competitors. No custom GPTs, no Claude Projects etc.\n\nThen, I discovered that GPT-Pro unlocks an even more advanced model: o1-pro, with no usage limits. 🤯\n\nAs if that wasn’t enough, OpenAI dropped Deep Search last week, meant to be a complete game changer.\n\nAdd Sora and Operator (via VPN), and I was sold.\n\nFirst impressions: blown away.\n\nDeep Search + o1-pro is the real deal.\nIn minutes, it completed research tasks I had worked on for months.\n\nSora seems far from the mind-blowing demos we saw months ago.\nI’d say it’s comparable with Runway.\n\nBut, for $200/month it's virtually unlimited.\n\nTry replicating the same projects with Runway, and you'll easily spend the same amount or more. A single video project I worked on in September costed me around $70. So, all in all Sora is a good deal.\n\nOperator is also a bit underwhelming, but gives a clear idea of where Agents are heading.\n\nNot sure how long I’ll keep the subscription, but for now I’m all in.\n\nOver the next few weeks, I’ll be posting some real-life use cases of GPT-Pro in the context of content and marketing.\n\nStay tuned!",
  "url": "https://www.linkedin.com/feed/update/urn:li:ugcPost:7295199638070947842",
  "published_at": "2025-02-13T08:30:02.900000",
  "image":"2025-02-13.jpeg"
}